# -*- coding: utf-8 -*-

# Form implementation generated from reading ui file '.idea'
#
# Created by: PyQt5 UI code generator 5.11.3
#
# WARNING! All changes made in this file will be lost!
'''
有毛发 --> 哺乳动物
有奶 --> 哺乳动物
有羽毛 --> 鸟
会飞 & 会生蛋 --> 鸟
吃肉 --> 食肉动物
有锋利牙齿 & 有爪 & 眼向前方 --> 食肉动物
是哺乳动物 & 有蹄 --> 有蹄类动物
是哺乳动物 & 反刍 --> 有蹄类动物
是哺乳动物 & 是食肉动物 & 有黄褐色皮毛 & 有暗斑点 --> 豹
是哺乳动物 & 是食肉动物 & 有黄褐色皮毛 & 有黑色条纹 --> 虎
是有蹄类动物 & 有长脖子 & 有长腿 & 有暗斑点 --> 长颈鹿
是有蹄类动物 & 有黑色条纹 --> 斑马
是鸟 & 不会飞 & 有长脖子 & 有长腿 & 有黑白二色 --> 鸵鸟
是鸟 & 不会飞 & 会游泳 & 有黑白二色 --> 企鹅
是鸟 & 善飞 --> 信天翁
叫陈宣 & 很帅 --> 人类
'''
